# З Laboratorio de VLANs en Cisco Packet Tracer  
### 10 Casos de Uso Pr谩ctico  

---

##  Introducci贸n

Las **VLANs (Virtual Local Area Networks)** permiten segmentar una red f铆sica en varias redes l贸gicas, mejorando la **seguridad**, **rendimiento** y **organizaci贸n** del tr谩fico.

En estos laboratorios aprender谩s paso a paso c贸mo:
- Crear VLANs en switches Cisco  
- Asignar puertos a VLANs  
- Configurar enlaces troncales (Trunk)  
- Interconectar VLANs mediante routers (Router-on-a-Stick)  
- Usar VLANs nativas y de gesti贸n  

---

##  Requisitos previos

- Cisco Packet Tracer 8.2 o superior  
- Conocimientos b谩sicos de comandos en IOS (modo EXEC y configuraci贸n)  
- Comprensi贸n b谩sica de redes (direcciones IP, m谩scaras, subredes)

---

# И Casos de Uso Pr谩cticos

---

## З Caso 1: Creaci贸n de VLANs b谩sicas

**Objetivo:** Aprender a crear VLANs y asignarles nombres.

**Topolog铆a sugerida:**  
Un switch Cisco 2960

**Pasos:**

Switch> enable
Switch# configure terminal
Switch(config)# vlan 10
Switch(config-vlan)# name VENTAS
Switch(config-vlan)# exit
Switch(config)# vlan 20
Switch(config-vlan)# name IT
Switch(config-vlan)# exit
Switch# show vlan brief

Verificaci贸n:
show vlan brief

Confirmar que las VLANs 10 y 20 aparecen en la lista.

Observar que a煤n no hay puertos asignados.


З Caso 2: Asignaci贸n de puertos a VLANs

Objetivo: Asociar puertos f铆sicos a VLANs espec铆ficas.

Topolog铆a:
Switch 2960 con 4 PCs conectadas (2 por VLAN)

Pasos:
Switch> enable
Switch# configure terminal
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config)# interface fastEthernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch# end
Switch# show vlan brief

Verificaci贸n:

PCs dentro de la misma VLAN pueden hacer ping entre s铆.

No hay comunicaci贸n entre VLANs diferentes.


З Caso 3: VLAN nativa y de gesti贸n

Objetivo: Configurar VLAN de gesti贸n (para administraci贸n remota del switch).

Topolog铆a:
Switch con 1 PC de administraci贸n conectada.

Pasos:
Switch> enable
Switch# configure terminal
Switch(config)# vlan 99
Switch(config-vlan)# name ADMIN
Switch(config)# interface vlan 99
Switch(config-if)# ip address 192.168.99.2 255.255.255.0
Switch(config-if)# no shutdown
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport access vlan 99

Verificaci贸n:

Desde la PC, hacer ping a la IP del switch (192.168.99.2).



З Caso 4: Comunicaci贸n entre VLANs (Router-on-a-Stick)

Objetivo: Permitir comunicaci贸n entre VLANs usando un router.

Topolog铆a:
2 VLANs (10 y 20), switch conectado a router (G0/0).

Pasos:
Router> enable
Router# configure terminal
Router(config)# interface gigabitEthernet 0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit
Router(config)# interface gigabitEthernet 0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# exit
Router(config)# interface gigabitEthernet 0/0
Router(config-if)# no shutdown

Verificaci贸n:

PCs de VLAN10 y VLAN20 pueden comunicarse (ping cruzado).


З Caso 5: Configurar enlace Trunk entre dos switches

Objetivo: Permitir que varias VLANs viajen por un solo enlace entre switches.

Topolog铆a:
Dos switches conectados por un enlace.

Pasos:
Switch1(config)# interface fastEthernet 0/24
Switch1(config-if)# switchport mode trunk
Switch2(config)# interface fastEthernet 0/24
Switch2(config-if)# switchport mode trunk

Verificaci贸n:

PCs conectadas a VLAN10 en ambos switches pueden comunicarse.

Otras VLANs permanecen aisladas.


З Caso 6: VLAN nativa en enlace Trunk

Objetivo: Configurar una VLAN diferente como nativa.

Pasos:
Switch(config)# interface fastEthernet 0/24
Switch(config-if)# switchport trunk native vlan 99
Switch(config-if)# switchport trunk allowed vlan 10,20,99

Verificaci贸n:

Verificar con show interfaces trunk

Confirmar VLAN nativa: 99


З Caso 7: Restricci贸n de VLANs permitidas en un Trunk

Objetivo: Limitar qu茅 VLANs pueden pasar por el enlace.

Pasos:
Switch(config)# interface fastEthernet 0/24
Switch(config-if)# switchport trunk allowed vlan 10,20










